test/deepseek_v3.2-results-1224/converted_results/vllm_tp_tokenizer_reason_second_random_128k.txt
============ Serving Benchmark Result ============
Successful requests:                     50
Benchmark duration (s):                  1022.73
Total input tokens:                      6400000
Total generated tokens:                  5000
Request throughput (req/s):              0.05
Output token throughput (tok/s):         4.89
Peak output token throughput (tok/s):    157.00
Peak concurrent requests:                50.00
Total Token throughput (tok/s):          6262.67
---------------Time to First Token----------------
Mean TTFT (ms):                          509875.70
Median TTFT (ms):                        509892.40
P99 TTFT (ms):                           1008482.44
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          605.55
Median TPOT (ms):                        639.61
P99 TPOT (ms):                           655.48
---------------Inter-token Latency----------------
Mean ITL (ms):                           661.84
Median ITL (ms):                         31.47
P99 ITL (ms):                            3112.44
==================================================