test/deepseek_v3.2-results-1224/converted_results/vllm_tp_tokenizer_reason_second_random_2k_output.txt
============ Serving Benchmark Result ============
Successful requests:                     100
Benchmark duration (s):                  93.24
Total input tokens:                      100000
Total generated tokens:                  200000
Request throughput (req/s):              1.07
Output token throughput (tok/s):         2145.09
Peak output token throughput (tok/s):    2586.00
Peak concurrent requests:                100.00
Total Token throughput (tok/s):          3217.64
---------------Time to First Token----------------
Mean TTFT (ms):                          4118.21
Median TTFT (ms):                        4084.86
P99 TTFT (ms):                           7176.13
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          44.49
Median TPOT (ms):                        44.51
P99 TPOT (ms):                           46.01
---------------Inter-token Latency----------------
Mean ITL (ms):                           45.09
Median ITL (ms):                         43.19
P99 ITL (ms):                            45.94
==================================================