test/deepseek_v3.2-results-1224/converted_results/vllm_tp_tokenizer_reason_sharegpt-1.txt
============ Serving Benchmark Result ============
Successful requests:                     1000
Benchmark duration (s):                  108.65
Total input tokens:                      219111
Total generated tokens:                  197326
Request throughput (req/s):              9.20
Output token throughput (tok/s):         1816.09
Peak output token throughput (tok/s):    5993.00
Peak concurrent requests:                1000.00
Total Token throughput (tok/s):          3832.68
---------------Time to First Token----------------
Mean TTFT (ms):                          21298.91
Median TTFT (ms):                        15932.32
P99 TTFT (ms):                           48135.87
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          652.24
Median TPOT (ms):                        366.44
P99 TPOT (ms):                           2230.57
---------------Inter-token Latency----------------
Mean ITL (ms):                           244.97
Median ITL (ms):                         82.80
P99 ITL (ms):                            3268.00
==================================================